benchmarks/logs/2026-04-29_10-08-23/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   523.15us    0.90ms  13.88ms   94.58%
    Req/Sec    14.36k     1.75k   17.26k    55.50%
  Latency Distribution
     50%  302.00us
     75%  420.00us
     90%  527.00us
     99%    5.49ms
  857779 requests in 30.01s, 0.87GB read
Requests/sec:  28586.39
Transfer/sec:     29.61MB