benchmarks/logs/2026-04-29_10-08-23/soak_get_bookmarks.txt
Running 1m test @ http://localhost:8080/bookmarks
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    4.45ms  43.30ms   96.50%
    Req/Sec     5.44k   648.21     5.89k    88.33%
  Latency Distribution
     50%  538.00us
     75%    1.03ms
     90%    1.08ms
     99%   29.83ms
  325107 requests in 1.00m, 3.43GB read
Requests/sec:   5416.97
Transfer/sec:     58.53MB